---
kind: property
id: P:Autodesk.Revit.DB.Analysis.SpatialFieldManager.LegendTextTypeId
source: html/fce9ad33-53db-47a2-b505-993eff7fd532.htm
---
# Autodesk.Revit.DB.Analysis.SpatialFieldManager.LegendTextTypeId Property

Stores element id of text associated with common (result-independent) part of legend in view.

## Syntax (C#)
```csharp
public ElementId LegendTextTypeId { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - When setting this property: A non-optional argument was null